Tekla.Structures.ModelInternal.Operation.ViewPartRepresentationEnum
Enum to set the visibility state in the current view

Tekla.Structures.ModelInternal.Operation.ViewPartRepresentationEnum.WIRE_FRAME


Tekla.Structures.ModelInternal.Operation.ViewPartRepresentationEnum.SHADED_WIRE_FRAME


Tekla.Structures.ModelInternal.Operation.ViewPartRepresentationEnum.HIDDEN_LINES


Tekla.Structures.ModelInternal.Operation.ViewPartRepresentationEnum.RENDERED


Tekla.Structures.ModelInternal.Operation.ViewPartRepresentationEnum.SHOW_ONLY_SELECTED
